Repository: Sea-Bottle/Sea-Bottle-Jackal
Catalog: locales/*/LC_MESSAGES/jackalify.po
Languages: ru

source: The file {} does not exist!
ru: Файл {} не существует!

source: Wrong file extension '{}'! Try '.png', '.jpg', or '.jpeg' file!
ru: Неверное расширение файла '{}'! Используйте '.png', '.jpg', или '.jpeg' файл

source: Jackalifying algorithm
ru: Алгоритм зашакаливания

source: run fastapi server interface
ru: запуск серверного интерфейса fastapi

source: create jackalified gif instead of picture
ru: создать зашакаленную gif вместо картинки

source: picture you want to jackalify
ru: картинка, которую вы хотите зашакалить

source: path to save jackalified instance
ru: путь для сохранения зашакаленной сущности

source: -w must be a single argument!
ru: -w должен быть единственным аргументом!

source: Output file shouldn't be gif!
ru: Выходной файл не должен быть формата gif!

source: Output name should end with '.gif'!
ru: Имя выходного файла должно заканчиваться на '.gif'!

source: Output name should end with '.png', '.jpg' or '.jpeg'!
ru: Имя выходного файла должно заканчиваться на '.png', '.jpg', или '.jpeg'!

source: No input path given!
ru: Нет входного файла!

source: Usage – python jackalify.py input_image_path output_video_path
ru: Использование – python jackalify.py путь_до_входного_изображения путь_для_полученного_видео

source: Choose picture
ru: Выберите картинку

source: Jackalify picture!
ru: Зашакальте картинку!

source: Download GIF
ru: Скачать GIF

source: Download jackalified photo
ru: Скачать зашакаленную картинку
